<template>
	<div class="user">
		<h3>{{ user.firstName }} {{ user.lastName }}</h3>
		<p>Email: {{ user.email }}</p>
	</div>
</template>

<script>
export default {
	props: {
		// хз в чем разница, с 12 строкой вместо 13-15 отображается также
		// user: []
		user: {
			type: Object
		}
	},
}
</script>

<!-- 
Создайте компонент "Список пользователей" (UserList), который будет
отображать список пользователей из переданного массива. Каждый
пользователь должен быть представлен в виде отдельного
компонента "Пользователь" (User), принимающего пропсы с данными
о пользователе (например, имя, фамилия и электронная почта).
 -->